app/views/users/home.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."user_id" = $2  [["user_id", 3], ["user_id", 3]]
---

	<!--Post.find(params[:id]).likes.create(user_id: current_user.id) -->