app/views/posts/index.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
	<p>
		<%= post.likes.count%><span>