app/controllers/posts_controller.rb

  def index

    unless logged_in?
     redirect_to "/sessions/new"
    end
    # IS BREAKING SITE even when user logged in
    @posts= Post.all
    @posts = @posts.sort_by{ |post| post.likes.count }.reverse!
---
SELECT "posts".* FROM "posts"
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]

  def edit
    #bring up the selected post when button clicked
    #make form in views
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]

  def show
    # route already in place by resources
    #   post GET    /posts/:id(.:format)          posts#show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 0]]

  def create

    #sanitize the routes ( only allow certain fields )
    sanitized = params.require(:post).permit(:name, :description , :image)

    # create a new post object with the params from the request
    #post = Post.new(sanitized);
    post = current_user.posts.create(sanitized);
---
INSERT INTO "posts" ("name", "description", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy

      puts "/users/#{current_user.id}/home"

      @post = Post.find(params[:id])

      # destroy the database row
      @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 7]]

  def like_post

    if Post.find(params[:id]).likes.where(user_id: current_user.id).length == 0

      # Post.find(params[:id]).likes.create(user_id: current_user.id)
      current_user.likes.create(post_id: params[:id])

      redirect_to "/posts"
    else

      current_user.likes.where(post_id: params[:id]).destroy_all
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2  [["user_id", 8], ["post_id", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["post_id", 1], ["created_at", "2016-01-12 10:40:04.631970"], ["updated_at", "2016-01-12 10:40:04.631970"]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 23]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]

  def archived
    @post = Post.find(params[:id])
    @post.update(archived: true)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "posts" SET "archived" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["archived", "t"], ["updated_at", "2016-01-13 22:12:39.411766"], ["id", 3]]

  def unarchived
    @post = Post.find(params[:id])
    @post.update(archived: false)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "archived" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["archived", "f"], ["updated_at", "2016-01-13 22:13:12.315219"], ["id", 1]]

  def build
    @posts = Post.all
---
SELECT "posts".* FROM "posts"