app/controllers/users_controller.rb

  def index
    unless logged_in?
      redirect_to "/sessions/new"
    end

    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    #binding.pry
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def destroy

    @user = User.find(params[:id])

    # destroy the database row
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

  def home
    puts params[:current_user]
   @currentUserPosts = User.find(current_user.id).posts.where(user_id: current_user.id)
   @currentUserLikes = Like.where(user_id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = 3 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."user_id" = $2  [["user_id", 3], ["user_id", 3]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 3]]